package algorithmic.parser

enum class Token {
    ԱՆԾԱՆՈԹ,

    ԹՎԱՅԻՆ,
    ՏԵՔՍՏԱՅԻՆ,
    ԱՆՈՒՆ,

    ԱԼԳՈՐԻԹՄ,
    ՍԿԻԶԲ,
    ՎԵՐՋ,
    ԹԻՎ,
    ՏԵՔՍՏ,
//    INPUT,
//    PRINT,
    ԵԹԵ,
    ԱՊԱ,
    ԻՍԿ,
    ԱՅԼԱՊԵՍ,
    ԱՎԱՐՏ,
    ՔԱՆԻ,
    ԴԵՌ,
    ԱՐԴՅՈՒՆՔ,
//    FOR,
//    TO,
//    STEP,
//    CALL,

    ADD, // +
    SUB, // -
//    AMP, // &
    MUL, // *
    DIV, // /
//    MOD, // \
//    POW, // ^

    EQ, // =
    NE, // <>
    GT, // >
    GE, // >=
    LT, // <
    LE, // <=

//    AND, // ԵՎ
//    OR, // ԿԱՄ
//    NOT, // ՈՉ
    ՎԵՐԱԳՐԵԼ, // :=

    ՎԵՐՋԱԿԵՏ, // :, ։
    ՍՏՈՐԱԿԵՏ,
    ԿԵՏ_ՍՏՈՐԱԿԵՏ, // ;
    ՁԱԽ_ՓԱԿԱԳԻԾ, // (
    ԱՋ_ՓԱԿԱԳԻԾ, // )

    ՖԱՅԼԻ_ՎԵՐՋ
}