package algorithmic.parser

enum class Token {
    ԱՆԾԱՆՈԹ,

    ԹՎԱՅԻՆ,
    ՏԵՔՍՏԱՅԻՆ,
    ԱՆՈՒՆ,

    ԱԼԳՈՐԻԹՄ,
    ՍՏՈՐԵՎ,
    ՍԿԻԶԲ,
    ՎԵՐՋ,
    ԻՐԱԿԱՆ,
    ՏԵՔՍՏ,
    ԱՂՅՈՒՍԱԿ,
    ԵԹԵ,
    ԱՊԱ,
    ԻՍԿ,
    ԱՅԼԱՊԵՍ,
    ԱՎԱՐՏ,
    ՔԱՆԻ,
    ԴԵՌ,
    ԱՐԴՅՈՒՆՔ,

    ADD, // +
    SUB, // -
//    AMP, // &
    MUL, // *
    DIV, // /
//    MOD, // \
//    POW, // ^

    EQ, // =
    NE, // <>
    GT, // >
    GE, // >=
    LT, // <
    LE, // <=

    ԵՎ,
    ԿԱՄ,
    ՈՉ,

    ՎԵՐԱԳՐԵԼ, // :=
    ՎԵՐՋԱԿԵՏ, // :, ։
    ՍՏՈՐԱԿԵՏ,
    ԿԵՏ_ՍՏՈՐԱԿԵՏ, // ;
    ՁԱԽ_ՓԱԿԱԳԻԾ, // (
    ԱՋ_ՓԱԿԱԳԻԾ, // )

    ՖԱՅԼԻ_ՎԵՐՋ
}